---
kind: property
id: P:Autodesk.Revit.DB.Structure.MemberForces.IsValidObject
source: html/301fe5a1-dfbe-1ca3-c7c2-1689e305c501.htm
---
# Autodesk.Revit.DB.Structure.MemberForces.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.